app/controllers/zamowienies_controller.rb

  def pokaz
    @zamowienie = Zamowienie.find(params[:id])
---
SELECT  "zamowienies".* FROM "zamowienies" WHERE "zamowienies"."id" = ? LIMIT 1  [["id", 1]]

  def utworz
    @zamowienie = Zamowienie.new(zamowienie_parametry)
      if @zamowienie.save
---
INSERT INTO "zamowienies" ("klient_id", "status", "wartosc", "zawartosc", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["klient_id", 2], ["status", "W przygotowaniu"], ["wartosc", 244123], ["zawartosc", "Skarby"], ["created_at", "2017-01-19 13:09:30.058723"], ["updated_at", "2017-01-19 13:09:30.058723"]]

  def edycja
    @zamowienie = Zamowienie.find(params[:id])
---
SELECT  "zamowienies".* FROM "zamowienies" WHERE "zamowienies"."id" = ? LIMIT 1  [["id", 3]]

  def aktualizuj
    @zamowienie = Zamowienie.find(params[:id])
      if @zamowienie.update_attributes(zamowienie_parametry)
---
SELECT  "zamowienies".* FROM "zamowienies" WHERE "zamowienies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "zamowienies" SET "status" = ?, "updated_at" = ? WHERE "zamowienies"."id" = ?  [["status", "Wyslane"], ["updated_at", "2017-01-19 13:58:49.427892"], ["id", 3]]

  def kasuj
    @zamowienie = Zamowienie.find(params[:id]).destroy
---
DELETE FROM "zamowienies" WHERE "zamowienies"."id" = ?  [["id", 5]]
SELECT  "zamowienies".* FROM "zamowienies" WHERE "zamowienies"."id" = ? LIMIT 1  [["id", 5]]

  def usun
    @zamowienie = Zamowienie.find(params[:id])
---
SELECT  "zamowienies".* FROM "zamowienies" WHERE "zamowienies"."id" = ? LIMIT 1  [["id", 3]]